{
    "reviews": {
        "total": "403",
        "score": "9.1",
        "rating": "Superb",
        "breakdown": [
            {
                "name": "Cleanliness",
                "value": "9.1"
            },
            {
                "name": "Comfort",
                "value": "9.2"
            },
            {
                "name": "Location",
                "value": "9.2"
            },
            {
                "name": "Facilities",
                "value": "9"
            },
            {
                "name": "Staff",
                "value": "9.4"
            },
            {
                "name": "Value for money",
                "value": "8.8"
            },
            {
                "name": "Free WiFi",
                "value": "8.6"
            }
        ],
        "reviewlist": [
            {
                "date": "Reviewed: 30 October 2018",
                "name": "Stewart",
                "nationality": "Australia",
                "score": "9.2",
                "header": "All in all we enjoyed our stay and would certainly stay again.",
                "negative": "Little concerned on the slippy condition on the tiles in the pool as it caused my wife and another guest to slip and fall which was unfortunate",
                "positive": "Liked the easy access and the way staff treated you with a smile.\rRequests were very quickly sorted out."
            },
            {
                "date": "Reviewed: 29 October 2018",
                "name": "Lee-anne",
                "nationality": "Australia",
                "score": "10",
                "header": "Everything you need in this boutique sensational residence in the heart of Legian.",
                "negative": "Little concerned on the slippy condition on the tiles in the pool as it caused my wife and another guest to slip and fall which was unfortunate",
                "positive": "Breakfast delicious with great variety and freshly cooked.  Fantastic rooms with super comfy beds.  Staff are always friendly and helpful.  Location is perfect for walking to everything in Legian.  Love the rooftop pool."
            },
            {
                "date": "Reviewed: 27 October 2018",
                "name": "Anonymous",
                "nationality": "Australia",
                "score": "10",
                "header": "Top notch quality in all areas",
                "negative": "The only criticism would be can get noisy at the pool with kids as it's a very small rooftop pool\n",
                "positive": "The quality of furniture, bedding, bathroom amenities I could not fault. I was very impressed especially with the boutique style that was personable yet luxurious"
            },
            {
                "date": "Reviewed: 25 October 2018",
                "name": "Kendall",
                "nationality": "Australia",
                "score": "10",
                "header": "Perfect location for Legian lovers",
                "negative": "The pool is quite small and shallow but that’s what you get for a rooftop pool.",
                "positive": "Absolutely perfect location if you’re wanting to stay in the centre of Legian around all the wonderful restaurants. Our room was comfortable, clean and spacious. The staff were wonderful and friendly and helped with suggestions of treatment as I was sick from our previous hotel. \rEven though it’s ride at a busy interse you can’t hear any outside noise when you’re in your room"
            },
            {
                "date": "Reviewed: 25 October 2018",
                "name": "Tricia",
                "nationality": "New Zealand",
                "score": "10",
                "header": "Rama Residence a True Leader...",
                "negative": "Nothing. Loved it all.",
                "positive": "They have thought of absolutely everything ....iron, scissors you name it... its there. The staff were fantastic throughout the entire property. The pool ... wow what a lovely setting. The restaurant has an extensive menu and very obliging staff. Indri took such great care of me,  including a much appreciated \"upgrade\" wow what a treat. Free laundry on site ... that has got to be the deal breaker for families. You really must stay here ... Monday evening cocktails or mocktails for young n old alike on the top deck. The list goes on. Thank you so much Indri. "
            },
            {
                "date": "Reviewed: 23 October 2018",
                "name": "Kevin",
                "nationality": "Australia",
                "score": "9.6",
                "header": "Great",
                "negative": "Breakfast mediocre.swimming pool needs fencing because it’s on the top floor.",
                "positive": "Room was very good with comfortable bed,cooking facilities and large fridge.in central Legian with good shopping and resteraunts"
            },
            {
                "date": "Reviewed: 22 October 2018",
                "name": "Görkem",
                "nationality": "Turkey",
                "score": "6.7",
                "header": "The location of the hotel was perfect, it’s so close the...",
                "negative": "The towels and the bed sheets have some dirts on it, so it seems it’s not clean enough.",
                "positive": "The location of the hotel was perfect, it’s so close the center of Legian. We stayed in a large room and the kitchen was good to cook something, it has everything you need."
            },
            {
                "date": "Reviewed: 21 October 2018",
                "name": "Kc1984",
                "nationality": "Australia",
                "score": "5.8",
                "header": "Unfortunately disappointed ",
                "negative": "\nAfter visiting Bali many times before We tried this hotel as it had good reviews but for us it was far from a 4 star hotel. It lacked the traditional Bali vibe we like so much. It was a lot more just hotel type accommodation. The room we stayed in smelt terrible like damp and mouldy smell. The bathroom was mouldy and needed a good scrub! The pillows were horrible! We stayed 8nights here would not pay the money they charge to stay again. For a hotel that is only 2 years old its rooms and amenities need upgrading already! Don’t waste your time using the laundry facilities they take forever and still leave clothes damp. Overall disappointing! \n",
                "positive": "Location\nPool"
            },
            {
                "date": "Reviewed: 21 October 2018",
                "name": "Dan",
                "nationality": "Australia",
                "score": "5.4",
                "header": "Raw sewage overflowed in basement then the hotel was toxic...",
                "negative": "Raw sewage overflowed in basement then the hotel was toxic for days\nWouldn’t let us use pool towels to take to the beach\nTried to charge us $14 for a broken glass",
                "positive": "Location\nPool"
            },
            {
                "date": "Reviewed: 14 October 2018",
                "name": "Anonymous",
                "nationality": "Australia",
                "score": "9.6",
                "header": "The location is excellent, center of Legian and only 5...",
                "negative": "The food in the restaurant needs improvement.",
                "positive": "The location is excellent, center of Legian and only 5 minutes walk to the beach. The staffs are amazingly friendly, the room is clean, there’s washer with dryer on the 5th floor."
            },
            {
                "date": "Reviewed: 13 October 2018",
                "name": "Susan",
                "nationality": "Australia",
                "score": "7.5",
                "header": "The room was comfortable the staff were pleasant and a great location.",
                "negative": "The breakfast, it was made to order. I we would have preferred a buffet style. Like the other places I have stayed. The laundry had a washer and dryer system in one,it took around 4-5 hours to wash and semi dry it didn’t dry completely.",
                "positive": "Location and the cleaning staff were fantastic always had a smile and did great work"
            },
            {
                "date": "Reviewed: 10 October 2018",
                "name": "Olga",
                "nationality": "Russia",
                "score": "9.6",
                "header": "Good hotel👍🏻",
                "negative": "In first day there were not fresh towels, but it was changed very quickly ",
                "positive": "Very cozy small hotel with polite and friendly stuff. Good location, only 5 min from ocean"
            },
            {
                "date": "Reviewed: 8 October 2018",
                "name": "Shane",
                "nationality": "Australia",
                "score": "9.6",
                "header": "Upmarket Hotel at a Middle Budget Price",
                "negative": "The view from our room was of a building site. The staff forgot to replenish our towels a couple of times but were quick to replace them when we called reception. The price we paid was exceptionally good but I believe the price has increased between 50% and 100% since then.",
                "positive": "The breakfast was exceptional. The bed was comfortable and the room more spacious than expected. The view of the sunset from the rooftop pool is excellent. The staff were friendly and very accommodating."
            },
            {
                "date": "Reviewed: 7 October 2018",
                "name": "Mircea",
                "nationality": "Romania",
                "score": "8.8",
                "header": "Very friendly and helpfull staff, location is ok, on a...",
                "negative": "There was moldy smell in the room. Prices in the restaurant downstairs pretty high. Across the street is a very nice restaurant, cheaper and top quality food.",
                "positive": "Very friendly and helpfull staff, location is ok, on a crowded street, a few hundred meters from the beachfront, very nice pool with a lovely view, very confortable bed. Also good and rich breakfast. The sunset view by the pool at the last floor is worth the money."
            },
            {
                "date": "Reviewed: 7 October 2018",
                "name": "Peter",
                "nationality": "Australia",
                "score": "8.8",
                "header": "Great hotel in central Legian. Cosy hotel with roof top pool area.",
                "negative": "There was moldy smell in the room. Prices in the restaurant downstairs pretty high. Across the street is a very nice restaurant, cheaper and top quality food.",
                "positive": "Great central Location, Generous Room Size with one bed suite. Great sofa bed arrangement for kids. Great Rooftop Pool, Friendly Staff.  Small and Cosy Hotel, fairly newly renovated.  Convenient late checkout available."
            },
            {
                "date": "Reviewed: 7 October 2018",
                "name": "Jane",
                "nationality": "Australia",
                "score": "9.2",
                "header": "I little bit of luxury in the hustle and bustle of legian bali one of six hotels ",
                "negative": "The cost was expensive compared others we had stayed in \nThe bathroom doors had dropped and were dragging on the floor could do with some maintenance \nWe could here our next door neighbors with the tv up loud every morning i suppose that's our bad luck though that we had inconsiderate neighbors  the sound proofing in the room worked well for the noise out side ",
                "positive": "The bed was fantastic the room was spacious i liked that they had a water filter in the room but it did run out while we were there no drama though they filled it straight away it was my husbands birthday while we were there they left a lovley chocolate cake and a card for him on the day thst was very nice the breakfast was great you could ask for anything of the menu and they would also accommodate  you if it was not on there i liked that especially if your vegan the staff where fantastic always smiling happy and accommodating my daughter and her boyfriend are tripping around the world on there mountain bikes they were very good to let them take there bikes up in the lift to there room and store them in the balcony we stayed in a  two family suites i would stay there again "
            },
            {
                "date": "Reviewed: 6 October 2018",
                "name": "Leisa",
                "nationality": "Australia",
                "score": "8.3",
                "header": "The really enjoyed Rama Residence pool average but staff great, rooms clean and very nice.",
                "negative": "The pool and pool area very average you wouldn’t want to get to many people up there at once swimming and pool really not deep enough good for elderly people maybe",
                "positive": "The staff where fantastic helped with everything you needed desk staff extremely lovely"
            },
            {
                "date": "Reviewed: 6 October 2018",
                "name": "Tak",
                "nationality": "Singapore",
                "score": "8.3",
                "header": "Second stay and we were mostly happy",
                "negative": "Some parts of the room need maintenance. Some stains on pillowcases. Pool a little small. Shower pressure was a little weak. Shower temperature wasn’t consistent if the taps were turned past a certain level.",
                "positive": "Room was clean. Bed was comfortable. View from pool was fabulous. Staff was friendly. Close proximity to the beach. Lots of eateries and numerous mini marts located in the area."
            },
            {
                "date": "Reviewed: 29 September 2018",
                "name": "Booking_Yeah",
                "nationality": "Germany",
                "score": "9.2",
                "header": "Nice pool on the roof with great ocean view,perfect location...",
                "negative": "Some parts of the room need maintenance. Some stains on pillowcases. Pool a little small. Shower pressure was a little weak. Shower temperature wasn’t consistent if the taps were turned past a certain level.",
                "positive": "Nice pool on the roof with great ocean view,perfect location but still quiet on the upper floors, 2mins to the beach, transport service was good and for fair rates"
            },
            {
                "date": "Reviewed: 25 September 2018",
                "name": "kevnbec",
                "nationality": "Australia",
                "score": "8.3",
                "header": "Great Place to Stay with Easy Access to Everything Close By",
                "negative": "Hard to pick fault but if we have to...Our pillows were a little soft so we stacked them up for a good nights sleep and the swipe card for the lift and door lock played up sometimes. The pool towels were also a bit old and probably need replacing soon but apart from those little things, all else was perfect. We'll be back.",
                "positive": "Well located with easy access to transport, beach, cafes, bars and restaurants while staying in a modern, spacious room with a comfortable king size bed. There's a smallish but nice relaxing roof top pool and terrace with great views. Good WIFI and range of tv channels including FOX Sports if you need to watch a show. The reception, bar and restaurant are really well laid out and beautifully decorated with traditional Asian influences."
            },
            {
                "date": "Reviewed: 22 September 2018",
                "name": "Jason",
                "nationality": "Australia",
                "score": "10",
                "header": "Our whole holiday experience was awesome.",
                "negative": "Leaving to come home.",
                "positive": "Our whole holiday experience was awesome. Staff were excellent and accommodating for our needs, rooms were clean and comfy, food and drinks delicious and a roof top swimming pool with magnificent sunsets.\rOverall fantastic and would definitely return."
            },
            {
                "date": "Reviewed: 20 September 2018",
                "name": "Anthony",
                "nationality": "Australia",
                "score": "10",
                "header": "Will be back!!!",
                "negative": "Leaving to come home.",
                "positive": "We loved everything here. The beds and pillows are amazing!!! Within a couple of minutes walk to the beach, restaurants etc. The staff were as nice as you will find anywhere!"
            },
            {
                "date": "Reviewed: 18 September 2018",
                "name": "Afra",
                "nationality": "Australia",
                "score": "9.2",
                "header": "Great hotel, wonderful staff, perfect location in Legian.",
                "negative": "Our only negative was the pillows on the bed. Too soft and collapsed quickly with the weight of your head 😞",
                "positive": "Spacious rooms, well laid out and cater for every need . Nice pool on roof top and great location in Legian."
            },
            {
                "date": "Reviewed: 15 September 2018",
                "name": "Barb",
                "nationality": "Australia",
                "score": "9.2",
                "header": "Roof top pool - great view - not too crowded - staff were...",
                "negative": "Room layout - our room faced west so got very hot with the afternoon sun and the blinds had to be completely closed ",
                "positive": "Roof top pool - great view - not too crowded - staff were amazing helping with using equipment and answering queries"
            },
            {
                "date": "Reviewed: 15 September 2018",
                "name": "Anonymous",
                "nationality": "United Kingdom",
                "score": "6.7",
                "header": "Good hotel a bit over priced",
                "negative": "I think that the hotel should arrange airport pick up for free as it's quite close. They charge more than the blue bird taxis. They asked us to check all of the room items which was ridiculously long.",
                "positive": "It had a good bed and the water was hot. The hotel had a roof pool and small gym. It also was close to a massage place."
            },
            {
                "date": "Reviewed: 11 September 2018",
                "name": "Dong",
                "nationality": "Malaysia",
                "score": "9.2",
                "header": "Pretty much love the place!",
                "negative": "Hotel was near to Kutah beach about 6mins walking distance, however no beach towels provided. It could have been better if the hotel provides beach towels.",
                "positive": "Overall, bed was big enough and comfort for 2 adults and 1 child. If could have been better if the breakfast has more choices. However, pretty much enjoyed the time while my family stayed there at Rama Residence Padma."
            },
            {
                "date": "Reviewed: 6 September 2018",
                "name": "Alexander",
                "nationality": "Germany",
                "score": "9.2",
                "header": "Excellent hotel and location",
                "negative": "Room layout (for the family suite for 5/6) could be a bit better. \rSite is fairly cramped - it is a town centre hotel, with a shallow (1.4m?) pool on the roof.",
                "positive": "Excellent location - 5 min walk to the beach and near loads of shops\rSuperb breakfast - not a buffet, but waiter service on anything off the menu\rRoof top pool with sunset view\rWe were able to use the facilities for the afternoon after we left\rBuilding well built againt Earthquakes (which happened in Lombok)"
            },
            {
                "date": "Reviewed: 1 September 2018",
                "name": "Mark",
                "nationality": "Australia",
                "score": "9.6",
                "header": "Location was fantastic, but the Staff were amazing Richard...",
                "negative": "Had  to leave no more cocktail night’s ",
                "positive": "Location was fantastic, but the Staff were amazing Richard &. Indri best ever . Also restaurant Asian Spice brilliant food & draught Bintang ice cold  Wayan & Dylan, you were excellent. Thanks had a amazing holiday 🇦🇺. The best cocktail nites ever . "
            },
            {
                "date": "Reviewed: 31 August 2018",
                "name": "Luca",
                "nationality": "Italy",
                "score": "10",
                "header": "This is not a big hotel but so nice, comfortable with a...",
                "negative": "We loved everything",
                "positive": "This is not a big hotel but so nice, comfortable with a wonderful roof top area with pool. The one bedroom suite is very big and comfortable for a family of 4. The staff and the management are so memorably kind and professional. Food also is good (Breakfast +++).  In case we will come back to Legian, no doubt we will stay here again."
            },
            {
                "date": "Reviewed: 31 August 2018",
                "name": "Mary",
                "nationality": "Australia",
                "score": "9.2",
                "header": "Great location, staff and service and value for money, we would recommed this hotel.",
                "negative": "The bathroom design. The toilet was positioned in between the  shower and sink which made it awkward when dressing. The toilet is the first thing you see when entering the bathroom.  The functionality of the room would work better if the the  sink was moved to the location of the toilet and toilet in the corner.  The food at the restaurant was ok, but improvements could be made such as, providing a selection of breads such as sourdough. Improving the coffee and menu.  Would definitely stay again and recommend others to stay at this lovely hotel.",
                "positive": "We stayed in the studio room which was very comfortable. Location was excellent approximately 300m to the beach and 200m to Garlic lane and Legian st with a lot of shopping at local markets.  The hotel design was gorgeous fitted with antiques and a lovely colour palette. Staff were very attentive and helpful. Lovely roof top pool with a large area with day beds and outdoor seating. Very clean and well maintained. Really liked the liquid soap in the shower and near basin instead of regular soap."
            },
            {
                "date": "Reviewed: 29 August 2018",
                "name": "CherieWallace",
                "nationality": "Australia",
                "score": "10",
                "header": "Absolutely fabulous!",
                "negative": "Our room was directly under the pool deck, so every morning around 7am we were woken by the staff moving deck chairs and running around.",
                "positive": "The bed was huge and so comfortable! The staff are wonderful and nothing was too much trouble."
            },
            {
                "date": "Reviewed: 18 August 2018",
                "name": "Chris",
                "nationality": "Australia",
                "score": "10",
                "header": "Bed was large and comfy, room was also large, all amenities...",
                "negative": "Unable to find any faults.",
                "positive": "Bed was large and comfy, room was also large, all amenities were met, Staff were excellent. We have booked back in for another weeks stay."
            },
            {
                "date": "Reviewed: 17 August 2018",
                "name": "Anonymous",
                "nationality": "United Kingdom",
                "score": "10",
                "header": "Simply amazing, didn’t want to leave ",
                "negative": "Having to leave! ",
                "positive": "This was by far the nicest hotel we have stayed at so far. It was also the most expensive but we felt that we got our money’s worth. We had a studio room and the beds were really comfortable. The small kitchen was well stocked for utensils and the unlimited water cooler was a great surprise. The pool was beautiful and I loved floating around on the beanbags. The hotel is close to lots of nice restaurants and very close to the beach. The property is very clean and the rooms well maintained and decorated. "
            },
            {
                "date": "Reviewed: 11 August 2018",
                "name": "Esther",
                "nationality": "Indonesia",
                "score": "10",
                "header": "Very good value for money !",
                "negative": "No fault at all apart from the fact You have to fill in an inventory of all room contents which was a little time consuming but I suppose it is for our own benefit.",
                "positive": "Fantastic facilities and location, lovely helpful staff ! "
            },
            {
                "date": "Reviewed: 11 August 2018",
                "name": "Joshua",
                "nationality": "Netherlands",
                "score": "9.2",
                "header": "7 Nights of Pleasure at Rama!",
                "negative": "-Some towels have stains in them\n-Pillows and sofa should be cleaned more often / thoroughly due to extreme humid climate.",
                "positive": "-Roofpool with nice view\n-Laundry room\n-We had a single bedroom but was big enough for a family of 4 ( using the sofa bed ) at garden site\n- also booked room at street site and was not noisy due to double glass\n-Kitchen with refrigerator and a dinner table\n-Drinkwater dispenser\n-2 toilets \n-International tv channels\n-Ala-carte breakfast and good food\n-3 minutes walk from the beach\n-excellent staff\n"
            },
            {
                "date": "Reviewed: 28 July 2018",
                "name": "peterddd",
                "nationality": "Australia",
                "score": "9.6",
                "header": "Great stay!",
                "negative": "No complaints, you get what you pay for.",
                "positive": "All good, 150 $au, one bed apartment very good. Great bfast. Great front desk, all staff friendly and efficient."
            },
            {
                "date": "Reviewed: 19 July 2018",
                "name": "Tony",
                "nationality": "Australia",
                "score": "9.2",
                "header": "It was a great location.",
                "negative": "No complaints, you get what you pay for.",
                "positive": "It was a great location. A short walk to the beach. The room was comfortable and clean. Staff very very friendly and helpful. We would be happy to stay here again."
            },
            {
                "date": "Reviewed: 19 July 2018",
                "name": "Annette",
                "nationality": "Australia",
                "score": "10",
                "header": "Awesome location and modern property",
                "negative": "the breakfast options could have had more variety. After staying for 10 days you get a bit tired of the options, may be offer a buffet style breakfast rather than from a set menu",
                "positive": "Loved the location and the rooms.  We had two studio apartments which were great.  We were at the back of the property and looked out onto some shops and the refurbishment of the Padma Legian but overall was very happy with the hotel"
            },
            {
                "date": "Reviewed: 15 July 2018",
                "name": "Chris",
                "nationality": "Australia",
                "score": "5.4",
                "header": "It was ok",
                "negative": "Not enough lighting no mirror in the main bedroom no pool towels on arrival  people smoking in the breakfast area",
                "positive": "It was a ok place stayed better places for less money"
            },
            {
                "date": "Reviewed: 4 July 2018",
                "name": "Pamela",
                "nationality": "Australia",
                "score": "9.6",
                "header": "Great room in Legian ",
                "negative": "Pool area quite small with no bar at poolside. Window with a blind covering it separating the bathroom and the bedroom so when travel companion goes to the toilet in the middle of the night the light shines through. Very trivial but some people might want to know . ",
                "positive": "The hotel is gorgeous with the most comfortable beds and pillows in Bali. The hotel is situated close to the beach, garlic lane etc. The hotel restaurant is great, breakfast was delicious, not buffet but order off the menu. Great restaurants all around with fat bowl just a couple of doors away. The staff were so friendly and helpful, if I was in Legian I would definitely stay here again."
            },
            {
                "date": "Reviewed: 28 June 2018",
                "name": "Kevin",
                "nationality": "Australia",
                "score": "10",
                "header": "Great little hotel  close to everything but still quiet enough to feel relaxing .",
                "negative": "nothing",
                "positive": "Great little family hotel close to everything. Clean rooms, friendly staff, amazing pool. The included breakfast was nice and the restaurants menu for lunch + dinner is good too."
            },
            {
                "date": "Reviewed: 26 June 2018",
                "name": "Sarah",
                "nationality": "Australia",
                "score": "8.3",
                "header": "Nice clean rooms with lots of space.",
                "negative": "Breakfast was hit and miss & almost Always cold. Wifi connection was terrible having to re-login every time you opened your device & password expiring intermittently. ",
                "positive": "Nice clean rooms with lots of space. Staff at reception extremely friendly and professional. Great central location. "
            },
            {
                "date": "Reviewed: 26 June 2018",
                "name": "Chin",
                "nationality": "Malaysia",
                "score": "7.9",
                "header": "We took the family room and it was pretty comfy for the 5 of...",
                "negative": "Family room toilets insufficient for 5 pax. Doors should be frosted in part for privacy.\rBreakfast can be more variety. After 3 days its difficult to order cos menu limited",
                "positive": "We took the family room and it was pretty comfy for the 5 of us"
            },
            {
                "date": "Reviewed: 21 June 2018",
                "name": "Kellie",
                "nationality": "Australia",
                "score": "8.3",
                "header": "Great location and size of rooms with good attention to...",
                "negative": "They charged almost $7 for a glass that my son accidentally broke in the room. It was a basic drinking glass and disappointing that they wanted to profit from an accident.",
                "positive": "Great location and size of rooms with good attention to detail. Love the wardrobe inside the bathroom. View from rooftop was great. "
            },
            {
                "date": "Reviewed: 13 June 2018",
                "name": "Paraveen",
                "nationality": "Malaysia",
                "score": "6.3",
                "header": "Staffs are friendly.",
                "negative": "The towels & bathroom floor mat have stains. The room floor is sticky and not clean. Bathroom not clean, stains on the towel bowl. Bathroom floor mat not changed, the cleaner just throw the sands away onto the basin. ",
                "positive": "Staffs are friendly. Nice breakfast. "
            },
            {
                "date": "Reviewed: 11 June 2018",
                "name": "Trudie",
                "nationality": "New Zealand",
                "score": "10",
                "header": "Highly recommend.",
                "negative": "Nothing. ",
                "positive": "We stayed for 4 nights with our three children 12,10,6 yrs in the family room. The large rooftop pool was superb the kids loved it. Location was fantastic, just a quick walk to the beach and surf schools, restaurants and shopping. The breakfast was really good and the staff helpful and very polite. The beds are so comfortable. We would def come back here to stay again. Thank you Rama. "
            },
            {
                "date": "Reviewed: 9 June 2018",
                "name": "Anonymous",
                "nationality": "Australia",
                "score": "8.3",
                "header": "Great place to stay ",
                "negative": "Only things i didnt like where stained towels and bed sheets and the meals  down stairs at asian spice could have more variety especially for breakfast",
                "positive": "Great spot in the heart of great resturatants and street shopping and lots of spas..pool areas had a great view for sunset and nice and quiet , staff very friendly and rooms kept very clean"
            },
            {
                "date": "Reviewed: 4 June 2018",
                "name": "jfielding68",
                "nationality": "Australia",
                "score": "10",
                "header": "Excellent hotel accommodation to stay in Bali",
                "negative": "I don't think I could think of anything that could have been better",
                "positive": "Had such a lovely visit at Rama, free wifi, the rooftop pool provided a great opportunity to relax away from all the hustle and bustle the nearby streets provided. I would highly recommend this as an accomodation option in Bali. We paid for breakfast and it was well worth it"
            },
            {
                "date": "Reviewed: 2 June 2018",
                "name": "Amy",
                "nationality": "New Zealand",
                "score": "10",
                "header": "Everything !",
                "negative": "I don't think I could think of anything that could have been better",
                "positive": "Everything ! The people were amazing the food was great and the location was perfect! 2 min walk to the beach and so many good places to eat close by . Definitely stay here again !"
            },
            {
                "date": "Reviewed: 30 May 2018",
                "name": "Neece",
                "nationality": "Australia",
                "score": "8.3",
                "header": "Staff were very friendly, comfy  bed, great location - would...",
                "negative": "Breakfast was awful - only ate there 2 out of my 5 mornings even though I had breakfast included.",
                "positive": "Staff were very friendly, comfy  bed, great location - would definitely stay again."
            },
            {
                "date": "Reviewed: 29 May 2018",
                "name": "Jordan",
                "nationality": "Australia",
                "score": "10",
                "header": "It is obvious that both the big and the little details were...",
                "negative": "Breakfast was awful - only ate there 2 out of my 5 mornings even though I had breakfast included.",
                "positive": "It is obvious that both the big and the little details were considered at Rama Residence. The standouts for me were the noise-cancelling windows, the open breakfast menu (for the breakfast-included option), and THE MOST COMFORTABLE bed ever! The staff were thoughtful and accommodating at all times"
            },
            {
                "date": "Reviewed: 22 May 2018",
                "name": "Sara",
                "nationality": "Australia",
                "score": "8.8",
                "header": "Great rooms, in a great location, only a few little things that could be improved",
                "negative": "The check out was a bit of an issue with the hotel not being able to confirm if we could get a late checkout until 10am on the morning of depature, also the pool could do with a bar or wait staff for drinks, as each drink needed to be ordered by phone and then could take up to 30 minutes to be delivered.",
                "positive": "Overall property was clean, beds are extra big and extra comfy, the staff were friendly, breakfast was great and being halway between Legian beach and Garlic lane the location was fantastic, also and the tour company \"G'Day Bali\" that they recommended for day trips were amazing."
            },
            {
                "date": "Reviewed: 16 May 2018",
                "name": "Jayson",
                "nationality": "Australia",
                "score": "9.2",
                "header": "Had a great stay at the Rama Residence, a very nice hotel with great staff.",
                "negative": "WIFI needs some attention - keeps dropping out, More shade around the Swimming Pool.",
                "positive": "Hotel met all my expectations, Staff were great, Hotel facilities were fantastic, Breakfast was very good, Good restaurant."
            },
            {
                "date": "Reviewed: 11 May 2018",
                "name": "Cornelius",
                "nationality": "Germany",
                "score": "9.2",
                "header": "Very friendly staff, great rooftop pool and short distance...",
                "negative": "Breakfast took very long to serve and was not brought completely even though staff repeated our order",
                "positive": "Very friendly staff, great rooftop pool and short distance to the beach"
            },
            {
                "date": "Reviewed: 7 May 2018",
                "name": "Tricia",
                "nationality": "Australia",
                "score": "9.2",
                "header": "Clean and very comfortable.",
                "negative": "Bad lighting in bathrooms. Pool a bit shallow and No happy hour at the pool or good drink specials.",
                "positive": "Clean and very comfortable. Great rooms with fridge, kitchen. Washing machine very handy. Location good as lots of restaurants around and only cheap taxi fare to other areas. Excellent room service and friendly staff."
            },
            {
                "date": "Reviewed: 2 May 2018",
                "name": "Malcolm",
                "nationality": "Australia",
                "score": "10",
                "header": "Excellent",
                "negative": "As some travellers like quite make sure you request a room away from the family rooms. If your a family try and respect others.",
                "positive": "The bed was the most comfortable in years of travel"
            },
            {
                "date": "Reviewed: 25 April 2018",
                "name": "Natasha",
                "nationality": "Australia",
                "score": "10",
                "header": "Would definitely stay here again! Great value for money!",
                "negative": "The only small negative is the breakfast menu could have a bit more variety.",
                "positive": "The staff were wonderful! Our room was great, very clean and the bed was super comfy.  Short walking distance to the beach and Garlic Lane. Great value for money! Would definitely stay here again!"
            },
            {
                "date": "Reviewed: 18 April 2018",
                "name": "Erin",
                "nationality": "USA",
                "score": "9.6",
                "header": "True Balinese decorated hotel.",
                "negative": "This hotel is located in the middle of a busy road so expect music and lots of noise late at night. This did not bother us one bit as we slept very well.",
                "positive": "True Balinese decorated hotel. Great restaurant with top notch service and friendly staff."
            },
            {
                "date": "Reviewed: 16 April 2018",
                "name": "Lee-anne",
                "nationality": "Australia",
                "score": "10",
                "header": "Everything you need in this boutique sensational residence in the heart of Legian.",
                "negative": "This hotel is located in the middle of a busy road so expect music and lots of noise late at night. This did not bother us one bit as we slept very well.",
                "positive": "Ideal location! Sensational rooftop pool! Shopping, restaurants & massages all at the doorstep, with the beach so close. Extra comfy beds, lovely rooms and delicious breakfast with variety.  To top it off... the staff!  Ever so friendly and helpful.  A pleasure to stay at for all ages.  My 5th stay in 15 months and LOVE how all the staff remember you!  Will continue to stay here whether for business or pleasure whilst in Legian."
            },
            {
                "date": "Reviewed: 9 April 2018",
                "name": "karen sharp ",
                "nationality": "Sweden",
                "score": "10",
                "header": "Diamond in the rough ...",
                "negative": "That we didn't stay longer. ",
                "positive": "This new resort is right in the heart of everything.with walking distance to shop's restaurant bars ..and beach.... We had studio apartment ..it was big clean. and comfortable with plenty of room for the family.the staff we're so nice during our stay. very helpful expically Richard . took extra care of us a big thanks to everyone ..we will be coming back.. keep smiling.."
            },
            {
                "date": "Reviewed: 9 April 2018",
                "name": "Vimal",
                "nationality": "United Kingdom",
                "score": "10",
                "header": "Fabulous stay great location highly recommended!",
                "negative": "Nothing. Everything was perfect.",
                "positive": "Really friendly and genuine staff. Fantastic location very close to beach. Free room upgrade, very comfortable and spacious. Nothing was a hassle and was made very welcome. Lovely stay, highly recommended!"
            },
            {
                "date": "Reviewed: 8 April 2018",
                "name": "Sally",
                "nationality": "Australia",
                "score": "10",
                "header": "The most relaxing and best holiday we have had for many years",
                "negative": "Nothing. Everything was perfect.",
                "positive": "The family suite was fantastic. The beds were comfy and there was loads of space in the bathroom for everyone to be ready quickly. We cannot fault it at all. The kitchenette was a bonus. We will definitely stay here again. It had amazing facilities and was great value for money."
            },
            {
                "date": "Reviewed: 4 April 2018",
                "name": "Mandy",
                "nationality": "United Kingdom",
                "score": "10",
                "header": "I loved staying here.",
                "negative": "The beaches are suffering, like any other beach..... too mush rubbish/trash. This of course is not directly connected to the hotel; it is everyone’s fault. PLEASE TAKE THE RUBBISH/ TRASH AWAY WITH YOU.",
                "positive": "The staff are wonderful, and so hard working."
            },
            {
                "date": "Reviewed: 3 April 2018",
                "name": "James_Aus",
                "nationality": "Australia",
                "score": "10",
                "header": "The large bed and amazing pool!",
                "negative": "Slightly more breakfast options and some towels had minor stains.",
                "positive": "The large bed and amazing pool! The location was excellent and the restaurant was fantastic."
            },
            {
                "date": "Reviewed: 2 April 2018",
                "name": "Andrea",
                "nationality": "Australia",
                "score": "10",
                "header": "Oasis in the thick of things...",
                "negative": "The restaurant a little pricey and small portions but good location for people watching. \rBooking.com 'Genius late check out' didn't mean anything at the hotel and had to pay 50% of room rate for late check out (I know, not the hotel's fault).",
                "positive": "The bed.....we had come from diving in Komodo staying in cabins on a dive boat.  The bed was everything and more.  So was the shower for that matter. The staff were very friendly.  The roof top pool was like an oasis in the heart of bedlam too! Wouldn't hesitate to stay there again."
            },
            {
                "date": "Reviewed: 27 March 2018",
                "name": "Renee",
                "nationality": "Australia",
                "score": "8.3",
                "header": "If staying in Legian, this is a great hotel to base yourself at.",
                "negative": "Small rooms and could hear through the walls... not street noise, but internal guests.",
                "positive": "The staff were excellent and the hotel is in a great location of Legian."
            },
            {
                "date": "Reviewed: 20 March 2018",
                "name": "bb travellers",
                "nationality": "Canada",
                "score": "7.5",
                "header": "great location, wonderful staff, beach close by",
                "negative": "the balcony which on the booking.com site says has a balcony with chairs does not for the studios, there is a french door that can be unlocked but is barely wide enough to stand on. also there is insufficient clothes storage in the room, if you are there with a clothes selection there is little room to store, the rooms could be laid out better to allow for a clothes drawer instead of a useless table in the bedroom of the studio that just collects items.",
                "positive": "Overall the hotel was excellent, we stayed here on two seperate occassions during travel back to legian during a 2 week period, from the first staff exxpereicne at the desk through to the interaction with restaurtant staff all was very good. the manager richard was both very helpful and was always available to  ask questions of and toubleshoot problems. the hotel is approximately 2 blocks to a great sandy, surf, swim beach, many wonderful choices for restaurants are close by. the rooftop pool is a wonderful setting to enjoy a swim and take in the sun. the manger put on a early evening reception one day with appies and drinks, the opportunity to meet other guests and share travel experiences. there are many great hotels in the general area of the rama residence, this one is hard to pass up for the money, quiet good size rooms and great breakfast on menu selections."
            },
            {
                "date": "Reviewed: 19 March 2018",
                "name": "Frank",
                "nationality": "Australia",
                "score": "2.5",
                "header": "Classy home away from home with friendly staff just up from great body surf beach.",
                "negative": "Chairs needs pads because you can hear the floor above scraping them.",
                "positive": "The upgrade to a studio since the hotel was not full, (always a smart courtesy but never automatic in most places) and the great fifth floor rooftop pool deck, especially at sunset."
            },
            {
                "date": "Reviewed: 18 March 2018",
                "name": "Lisa",
                "nationality": "Australia",
                "score": "9.6",
                "header": "Lovely place to stay, staff are great and I loved the breakfast, great coffee as well.",
                "negative": "Only a few little things that need improving, addition of towel and hand towel rails in the bathroom, we found that our towels and swimwear did not dry in the room and there is very limited cupboard space for your clothes. These are only small things that can be easily improved.",
                "positive": "Loved the fresh cooked A la carte breakfast, nice change from the buffet. Rooms were lovely and air con worked well. Roof top pool was so peaceful and clean, the staff were always helpful. Even had a free 2 hour cocktail get together with other guests at the roof top pool. Rich and his staff have done great work on making Rama Residence a great place to stay. Although we didn't use it I do think the self contained kitchen is great. Highly recommend Rama Residence and the location is great."
            },
            {
                "date": "Reviewed: 16 March 2018",
                "name": "Rajeev9514 ",
                "nationality": "India",
                "score": "10",
                "header": "Value for money",
                "negative": "Nothing to complain everything was flawless",
                "positive": "Loved the rooms super clean and the staff was amazing. Richard, Kadek and Antara were super friendly. Sunset at the pool was amazing. Will definitely recommend this place ✌️"
            },
            {
                "date": "Reviewed: 12 March 2018",
                "name": "Nadezhda",
                "nationality": "Russia",
                "score": "8.8",
                "header": "Very clean and tidy\r",
                "negative": "Along with a check-in you're given a list of everything that's in the room you have to check and sign. It took me 30 minutes to calculate the amount of plates, glasses, check if every little thing (including DND sign) is present only to find that we're 1 pool towel short. Tbh, i didn't understand the nesessity of this at all, I usually trust the property I stay at to not charge me for any lost spoons, so it is just a bit of time waste for everybody.\rThe pool is only about waist-deep (very nice otherwise).\rBe aware that the area is very busy and touristy (we knew it an booked it for our last nights to stay close to the beach and to the airport).",
                "positive": "Very clean and tidy\rFriendly welcoming staff\rBeautiful pool at the rooftop\rLocated just a few minutes from the beach and one of the main streets but still no road or party noises.\rBreakfast is ok\rWorth the money 100%"
            },
            {
                "date": "Reviewed: 12 March 2018",
                "name": "Kaitlyn",
                "nationality": "USA",
                "score": "10",
                "header": "Loved it! Will be back =]",
                "negative": "Just a few small things: The breakfast was good tasting but the options were limited. As a vegan, I ate bread and jam everyday, which became boring. At least with a buffet you can pick and choose things but this was hard to do with a limited menu. The room came with all the toiletries except toothpaste and tissues so those should be included.",
                "positive": "The room was more spacious than what we anticipated, which is always a lovely surprise. It was very clean and plenty of room for three adults. The divider between the rooms was awesome! Very quiet between the two beds. The beds were very comfortable, especially the soft bed. It's not your typical sofa bed but way nicer than what I expected. The staff was extremely friendly and accommodating. Check in was very smooth and welcoming. The first night we stayed there was a happy hour on the rooftop for the sunset so we really enjoyed that. The pool and view are really nice. We enjoyed that a lot. The hotel location is excellent. Close to get to Kuta but also north to Seminyak. Easy to take tours around the island from this spot as well."
            },
            {
                "date": "Reviewed: 12 March 2018",
                "name": "Chris",
                "nationality": "Australia",
                "score": "10",
                "header": "Excellent, excellent, excellent.",
                "negative": "I should have stayed longer.",
                "positive": "Fantastic room, beautiful roof top pool, great staff (special mention, Kadak).\rThe hotel was very clean and the rooms were modern and in excellent condition.\rThe breakfast was good nothing amazing but no complaints I enjoyed it.\rGreat location, close to the beach, Fat Cow Restaurant and shops, ATMs etc\rThe gym was small but adequate, air conditioned, with 3 cardio machines and a rack of dumbbells."
            },
            {
                "date": "Reviewed: 12 March 2018",
                "name": "Notdunroamin",
                "nationality": "United Kingdom",
                "score": "10",
                "header": "Great stay, sorry we were only overnighting!",
                "negative": "well, the bad news was, as we went to check in, we were told the hotel was fully booked - but the good news was - we were upgraded to a suite! Thanks Radma Residence!",
                "positive": "Lovely room, great staff. We enjoyed the bar and restaurant, good food. The bed was amazingly comfortable. We travel permanently, and comfy beds are difficult to find!"
            },
            {
                "date": "Reviewed: 12 March 2018",
                "name": "Goodo2",
                "nationality": "Australia",
                "score": "10",
                "header": "Great location to beach & shopping,,  amazing rooftop...",
                "negative": "Nothing ",
                "positive": "Great location to beach & shopping,,  amazing rooftop pool to watch the sunset.Stayed in a studio room with extremely comfortable bed & pillows, great size with separate lounge. Very approachable,  friendly staff especially mine host Richard. We will be back."
            }
        ]
    }
}