{
    "reviews": {
        "total": "720",
        "score": "8.2",
        "rating": "Very Good",
        "breakdown": [
            {
                "name": "Cleanliness",
                "value": "8"
            },
            {
                "name": "Comfort",
                "value": "8"
            },
            {
                "name": "Location",
                "value": "8.7"
            },
            {
                "name": "Facilities",
                "value": "7.9"
            },
            {
                "name": "Staff",
                "value": "8.7"
            },
            {
                "name": "Value for money",
                "value": "7.7"
            },
            {
                "name": "Free WiFi",
                "value": "8.2"
            }
        ],
        "reviewlist": [
            {
                "date": "Reviewed: September 29, 2018",
                "name": "Don'treviewbut.....",
                "nationality": "New Zealand",
                "score": "7.5",
                "header": "Loud",
                "negative": "We were in a room that faced the street front, and the bar noise from below and across the road is VERY loud till about 12:30, every night of the week.  The staff were great, and did move us to another room, but this split myself and my husband up, as we had two seperate rooms, so had a child in each room at night.    Would definitely wait for the renovations to be complete, and get a back unit.",
                "positive": "Staff were really helpful and accomodating."
            },
            {
                "date": "Reviewed: September 15, 2018",
                "name": "Keli",
                "nationality": "Australia",
                "score": "7.9",
                "header": "Lovely resort & restaurant. Beautiful staff. Location very close to beach but noisy. Enjoyed my stay",
                "negative": "Arriving to learn the resort was being renovated was disappointing. Main pool closed - only small pool open and hardly any chairs. No communication of this when booking or when receiving emails from the hotel to say looking forward to my arrival. Original room was poor - smelly, tight, war zone for a view. With a constructive conversation were offered another room. This room was lovely.\rWifi in the room was terrible and really did cause frustration. \rThe noise from the rock band outside on the street got old after the first few nights ... just because it was pretty average and loud! Next morning the school had their songs and announcements on the PA ... sooooo loud and actually woke us each day, even Saturday!",
                "positive": "Every staff member was friendly and professional.\rThe restaurant was lovely, open and had a good vibe. All meals were delicious. \rBreakfast was great - not the best I've had but plenty of choice and fresh. \rThe room was beautiful, comfy beds! Extra large bathroom was great. \rDistance to the beach is fantastic!"
            },
            {
                "date": "Reviewed: August 28, 2018",
                "name": "Denis",
                "nationality": "Malaysia",
                "score": "6.3",
                "header": "Not worth the money paid.",
                "negative": "Too much noise due to ongoing renovation works. Loud music across the road until midnight. Had requested for late check out which was denied very rudely.",
                "positive": "Food was good"
            },
            {
                "date": "Reviewed: August 25, 2018",
                "name": "Gordon",
                "nationality": "Australia",
                "score": "8.3",
                "header": "The staff are great friendly, helpful polite\r",
                "negative": "The resort is undergoing renovations that we weren’t aware of and half the facilities were unavailable to use.\rThe beds are hard\rGuests are not quite around the room doors",
                "positive": "The staff are great friendly, helpful polite\rThe food is great flavours and variety\rGreat location"
            },
            {
                "date": "Reviewed: August 22, 2018",
                "name": "Damien",
                "nationality": "Australia",
                "score": "8.8",
                "header": "Loud music from across the road.",
                "negative": "Loud music from across the road. Our room was on the same side from Jalan Kartika which was fine and great views. Just spoiled by one little outdoor bar with loud speakers.",
                "positive": "The staff are great friendly, helpful polite\rThe food is great flavours and variety\rGreat location"
            },
            {
                "date": "Reviewed: August 13, 2018",
                "name": "Tori_Ahmed",
                "nationality": "Bangladesh",
                "score": "6.7",
                "header": "Start of each day was great with the large range of buffet...",
                "negative": "Thr washroom was pretty small and not very well maintained. The towels had torned edges and the floor had stains. The hotel is under construction so it seems a bit small and not well planned.",
                "positive": "Start of each day was great with the large range of buffet breakfast of the hotel. The staff were very friendly and helpful. The location is good if you want shop or live amidst the city crowd."
            },
            {
                "date": "Reviewed: August 7, 2018",
                "name": "Kj",
                "nationality": "Australia",
                "score": "6.7",
                "header": "The location.",
                "negative": "There was constant noise grom the building site  often late into the night. The original room was disgusting. Enamel falling off the bath with a mouldy plastic curtain over the bath. I was upgraded, but the cleanliness left a lot to be desired. Floor not washed once, although I requested it due to my feet being black all the time. It wasn't the staff's fault. Staff were lovely. I just felt cheated, as the place did not resemble in any way, the photos or description. I have been going to Bali for 15 years, and this was my worst experience. They should have notified potential guests about the renovations. No fault with staff, apart from the floors. Breakfast was very ordinary. Would not recommend it to anyone, and I am very disappointed with Booking.com. i will never book through them again.",
                "positive": "The location.\nStaff were nice and accommodating. Not their fault re inconvenience.\nThe upgrade was very much appreciated.\nRestaurant food and room service very good."
            },
            {
                "date": "Reviewed: July 29, 2018",
                "name": "Lisa",
                "nationality": "Australia",
                "score": "10",
                "header": "The staff were so accommodating \r",
                "negative": "There was constant noise grom the building site  often late into the night. The original room was disgusting. Enamel falling off the bath with a mouldy plastic curtain over the bath. I was upgraded, but the cleanliness left a lot to be desired. Floor not washed once, although I requested it due to my feet being black all the time. It wasn't the staff's fault. Staff were lovely. I just felt cheated, as the place did not resemble in any way, the photos or description. I have been going to Bali for 15 years, and this was my worst experience. They should have notified potential guests about the renovations. No fault with staff, apart from the floors. Breakfast was very ordinary. Would not recommend it to anyone, and I am very disappointed with Booking.com. i will never book through them again.",
                "positive": "The staff were so accommodating \rThey went above and beyond to make sure our stay was comfortable \rI appreciate what they did for my family and will be staying here again"
            },
            {
                "date": "Reviewed: July 26, 2018",
                "name": "Anonymous",
                "nationality": "Denmark",
                "score": "7.0",
                "header": "Nice hotel but a lot of noice from the street",
                "negative": "The cosy quiet (village like) climat of the hotel as presented on the pictures do not match at all what you get. The hotel is located on the corner of two busy streets with a lot of bars, restaurants etc. and there is a lot noise til late night. A regular large city and busy hotel. Large part of the area is under renovation/construction. The rooms and bathrooms are a bit worn out.",
                "positive": "Very polite staff, nice pool, good breakfast."
            },
            {
                "date": "Reviewed: July 24, 2018",
                "name": "Ibrahim Oman",
                "nationality": "Oman",
                "score": "7.1",
                "header": "Good location with confortable rooms and good facilities.",
                "negative": "The place is currently under renovation with large part of its garden and pool area out of limit. The rooms and their toilets can do with renovation. We also found the lighting not very practical as no central lighting and room have different side lights. Not meaning any offence but the side light may be better without statue as these are very prominent and make the room leaning to a religious nature not comfortable to all guests.",
                "positive": "Good location with confortable rooms and good facilities.  We enjoyed the family and interconnecting rooms which were ideal for big family. The place is clean and confortable with good restaurant and receptive staff. The location is ideal for enjoying bali as the beach is nearby and so are the shops."
            },
            {
                "date": "Reviewed: July 19, 2018",
                "name": "Rachel",
                "nationality": "Australia",
                "score": "2.5",
                "header": "overpriced and dissapointing",
                "negative": "The room. The pool area..The location..the price..",
                "positive": "This was extremely expensive and disappointing. It was old,the pool run down,noisy with bands playing loudly. the room was musty and I am so upset we wasted our $ . I feel the pictures did not portray the reality.Do not stay here.."
            },
            {
                "date": "Reviewed: July 14, 2018",
                "name": "sares_24",
                "nationality": "Australia",
                "score": "6.7",
                "header": "Lovely property with welcoming staff. Location not great and pool was disappointing",
                "negative": "Location wasn't great - had to walk a long way to Seminyak Square. The pool was in the shade so it was freezing. No other pool at the resort to use. The restaurant's buffet breakfast was average. The dinner menu had basic Indonesian food and a lot of western food (which did not appeal to us). Amenities were average.",
                "positive": "Lovely property staff were very accommodating."
            },
            {
                "date": "Reviewed: June 25, 2018",
                "name": "Robert",
                "nationality": "New Zealand",
                "score": "4.2",
                "header": "The hotel is in a great location, right in Kuta Square.",
                "negative": "The room was dark & smelled like something between moth balls & cigarette smoke. The bathroom was not clean and the plug in the bath did not drain. We booked because of the two pools but one was closed due to large renovations taking place which we were not made aware of at the time of booking. The renovations will be going on for a long time so people should be aware of this when booking. Lots of bars under the hotel mean that the rooms are very noisy. ",
                "positive": "The hotel is in a great location, right in Kuta Square. Everything is within walking distance. "
            },
            {
                "date": "Reviewed: June 15, 2018",
                "name": "Alex",
                "nationality": "Australia",
                "score": "5.8",
                "header": "Construction going on from very early in the morning right...",
                "negative": "Construction going on from very early in the morning right near our room waking us up every day, no mention of it prior. Also pool not there, also failed to mentioned. Paid over $100 a night to have half a hotel & be woken by loud construction everyday, with know prior knowledge or warning. \n",
                "positive": "The hotel is in a great location, right in Kuta Square. Everything is within walking distance. "
            },
            {
                "date": "Reviewed: May 29, 2018",
                "name": "Sonakshi Pandey",
                "nationality": "India",
                "score": "3.3",
                "header": "Very disappointing experience",
                "negative": "When we reached their internet wasn't working so we didn't have the  keys to our room until the end of the day. The room was dusty and the bathroom wasn't clean. The so called city view was of a billboard and the hotel is opposite a bar with love performance every night which makes noise making it impossible to sleep. The in room dining food is not good. ",
                "positive": "Location is the only good thing about this hotel."
            },
            {
                "date": "Reviewed: May 26, 2018",
                "name": "John",
                "nationality": "United Kingdom",
                "score": "8.3",
                "header": "Excellent breakfast with a wide range of choices and...",
                "negative": "Everything was satisfactory.",
                "positive": "Excellent breakfast with a wide range of choices and attentive staff. A large room with eight separate lights ! Location is excellent for beach, restaurants and shopping."
            },
            {
                "date": "Reviewed: May 17, 2018",
                "name": "Pamungkas",
                "nationality": "Indonesia",
                "score": "7.9",
                "header": "Meet my expectation but not more",
                "negative": "Staff in front office lack of skill,they didn't know how to operate edc machine,i have to pay with the cash instead of debit card,hotel under renovation,noisy from live music until 12 pm",
                "positive": "Friendly staff in the restaurant,good breakfast and good lunch and dinner in gabah restaurant,location close to everywhere"
            },
            {
                "date": "Reviewed: May 17, 2018",
                "name": "Ya",
                "nationality": "Japan",
                "score": "5.8",
                "header": "Wouldn’t have booked had I known about the renovation. Feel deceived.",
                "negative": "The official website and booking.com did not make it clear that there was a huge renovation going on, meaning the main pool was closed and there were constant construction sounds going on during the day. Really should have checked other guest feedback better so that’s on me but booking.com makes it tricky to find all the feedback.\rThe room was very loud with nearby bar playing live music until about midnight. \rInternet kept cutting off and only allowed two devices ie for the two guests in the room to be connected. Annoying if you have a laptop and phone etc and want to use both. \rBathroom was dirty. Room smelt musty.",
                "positive": "The staff responded to any issues promptly and were courteous. The location is very central so it was easy to go to other restaurants, shops and the beach."
            },
            {
                "date": "Reviewed: May 13, 2018",
                "name": "Wikus",
                "nationality": "Australia",
                "score": "7.9",
                "header": "Good location, close to nice beach and shopping. Friendly, helpful staff.",
                "negative": "May 2018, hotel under renovation, big pool closed down. Live-bands across the road and sport bars underneath the hotel. We had to be moved from road facing room to a garden room due to noise, but management was very helpful in making it happen.",
                "positive": "Great staff, excellent breakfast options (non-vegetarian here). Beach is very close, just a 2 minute walk through the market area. Lots of shopping and places to eat."
            },
            {
                "date": "Reviewed: May 11, 2018",
                "name": "Debs",
                "nationality": "United Kingdom",
                "score": "9.2",
                "header": "Totally fantastic place",
                "negative": "Can't think of a thing!",
                "positive": "Building work going on so the firm informed me and arranged a room at another hotel within the group. \rI stayed at The Kuta Seaview. They picked me up from airport and took me to my resort. It was absolutely fantastic. The welcome was lovely. The staff were excellent. The spa was amazing too. I will most definitely be returning to any of the hotels within the group. Absolutely outstanding customer service 10/10"
            },
            {
                "date": "Reviewed: April 11, 2018",
                "name": "Adele",
                "nationality": "Australia",
                "score": "7.5",
                "header": "Good! But the renovations were a little let down",
                "negative": "That we weren’t informed about the renovations \rAircon issues also that were sorted but took a while to sort it out",
                "positive": "Staff were great \rPool and gardens and beautiful \rFood is great and great service"
            },
            {
                "date": "Reviewed: April 11, 2018",
                "name": "Kamaldeep",
                "nationality": "Australia",
                "score": "5.0",
                "header": "Not recommended.",
                "negative": "Pictures of a massive pool which does not exist as it is still under construction 👎. Resort club and reception has no Aircon. Advertised gym doesn’t exist. The toilets in the room don’t flush the “materials” in the first go.... All in all if you re travelling with family with young kids steer clear from this hotel. It is not a resort. It’s a hotel with minimal facilities. Lifts were broken most of the time and we stayed on the 5th floor!!! We were directed to the goods lift. Whole place needs a renovation . All in all a bad stay.",
                "positive": "The staff, the restaurant"
            },
            {
                "date": "Reviewed: April 8, 2018",
                "name": "Belinda",
                "nationality": "Australia",
                "score": "8.8",
                "header": "Location,shopping, spa & food",
                "negative": "Unfortunately the Ramayana was under extram Reno’s which once complete it will be fabulous",
                "positive": "I’ve stayed at the Ramayana. I love it for the location for shopping & eating & the day spa is amazing."
            },
            {
                "date": "Reviewed: April 4, 2018",
                "name": "Jose",
                "nationality": "East Timor",
                "score": "9.2",
                "header": "The bed is really comfy and they provide a comfy cot for my...",
                "negative": "Too much noises till midnight. I check in with baby, they should know better about the situation, and put us in the room with the balcony to the back side (swimming pool) instead of looking to the main road.",
                "positive": "The bed is really comfy and they provide a comfy cot for my baby too.. And my baby had a stomach flu and was vomiting few times inside the room, but the cleaner always ready to clean up and change everything eventou it happens twice in a day."
            },
            {
                "date": "Reviewed: April 3, 2018",
                "name": "Lucy",
                "nationality": "Australia",
                "score": "7.9",
                "header": "Great location beautiful hotel",
                "negative": "The air conditioning in the room was not working so great and the bathroom is a little small, buffet breakfast could be better other than that everything was great",
                "positive": "Great location! Hotel is great and traditional Indonesian food is amazing"
            },
            {
                "date": "Reviewed: April 3, 2018",
                "name": "Sharene",
                "nationality": "Australia",
                "score": "7.9",
                "header": "Disappointing",
                "negative": "No one told us it was under construction, the pools were closed, the noise horrendous and only operating at a third of its normal capacity. Would have been nice if it was noted that there were major renovations. The jack hammers started at 7am and went all day and evening until around 10pm",
                "positive": "The staff tried to allay the situation by upgrading us to the resort suites but jack hammers started at 7am each morning and went all day. The pool that was still open was overcrowded but the staff were excellent"
            },
            {
                "date": "Reviewed: March 26, 2018",
                "name": "Johnny",
                "nationality": "Philippines",
                "score": "4.6",
                "header": "Needs a lot of improvement, moretrainings for the staff especially in the aspects of guest relations",
                "negative": "1. Water closet in the room is leaking.\r2. Canopy mosquito net is very untidy.\r3. Upon check-in we told the reception staff that our flight back home is at 0835am and inquire when time the breakfast will be served. They told us breakfast is available at 6am but it's not ready when we arrive at the dining area.\r4.  They did not even offer breakfast boxes for us to bring to airport, very poor service.",
                "positive": "Very good location, almost at the center of Kuta"
            },
            {
                "date": "Reviewed: March 25, 2018",
                "name": "Agnieszka",
                "nationality": "Poland",
                "score": "9.6",
                "header": "Wonderful time in Ramayana Resort& Spa Bali <3",
                "negative": "1. Water closet in the room is leaking.\r2. Canopy mosquito net is very untidy.\r3. Upon check-in we told the reception staff that our flight back home is at 0835am and inquire when time the breakfast will be served. They told us breakfast is available at 6am but it's not ready when we arrive at the dining area.\r4.  They did not even offer breakfast boxes for us to bring to airport, very poor service.",
                "positive": "Wszystko na jak najwyższym poziomie, wspaniała atmosfera, czystość, niesamowity wybór jedzenia i napojów. Czysty basen, relaksujący masaż, pomoc w zorganizowaniu transportu czy wyjazdu :)"
            },
            {
                "date": "Reviewed: March 10, 2018",
                "name": "Patricia",
                "nationality": "Australia",
                "score": "6.3",
                "header": "Great location, very noisy and run diwn",
                "negative": "Noise from local bands nearby are really loud till well into the early hours, makes sleeping impossible. \rDoing major renovations, but existing rooms have a lot of issues, air con doesn’t work properly, lights don’t work properly. Breakfast is okay.... had better in other resorts. Atm only front pool is available.... needs more beds and to get pool service is difficult and they definitely don’t pick up plates/glasses etc",
                "positive": "Location is excellent."
            },
            {
                "date": "Reviewed: March 6, 2018",
                "name": "Angela",
                "nationality": "Australia",
                "score": "5.8",
                "header": "Average. Good location for all the action.",
                "negative": "We ordered a ride from the airport which didn’t arrive. Pool wasn’t open and rooms are dated and bed not very comfy.",
                "positive": "Staff are lovely. Location is great."
            },
            {
                "date": "Reviewed: February 28, 2018",
                "name": "Robert",
                "nationality": "Australia",
                "score": "7.5",
                "header": "We will be staying at other places from now given same prices and more modern facilities.",
                "negative": "Not that we didn't like anything but the entire room could do with a modern uplift. Everything felt dated and the bed was too hard for our liking.",
                "positive": "Location and staff were excellent."
            },
            {
                "date": "Reviewed: February 27, 2018",
                "name": "Donna",
                "nationality": "New Zealand",
                "score": "8.3",
                "header": "Good value for money central location",
                "negative": "Breakfast limited selection - \rOnly one pool available due to reno next door I think\rBed hard\rRoom service meal not appetising , lacked presentation ,satay overcooked and vege wilted /looked like raw cabbage leaves just slapped onto plate\rStaff very helpful tho",
                "positive": "Location\rAccess\rGood air con although loud \rLarge corner room \rEasy access to stadium bar"
            },
            {
                "date": "Reviewed: February 27, 2018",
                "name": "Kati",
                "nationality": "Finland",
                "score": "4.2",
                "header": "Location - a shopping area close to to the hotel.",
                "negative": "Reception personnel - they were really rude and lied about the room availability. We booked two double rooms, but got twins. When asked about double rooms, the first response was that the hotel is fully booked and none of doubles or even rooms available. Well, they found rooms after I did not give up with my request to have a room type I booked - and which was also confirmed.\nRoom was worn-out, not carefully cleaned and really noisy until 0:30am due to a live music bar located just opposite to the hotel. Another room facing to the garden was more quiet though. ",
                "positive": "Location - a shopping area close to to the hotel. "
            },
            {
                "date": "Reviewed: February 21, 2018",
                "name": "75fee",
                "nationality": "Australia",
                "score": "9.2",
                "header": "Where we stay every time in bali!",
                "negative": "Its close to everything and the breakfast is included in price and there is security at every door.",
                "positive": "Staff are beautiful always smiling......close walking distance to everything...restaurant is yummy...security is a bonus!"
            },
            {
                "date": "Reviewed: February 13, 2018",
                "name": "Amy",
                "nationality": "Australia",
                "score": "8.8",
                "header": "Amazing location and nice resort but loud construction works",
                "negative": "Prices of drinks a bit expensive when compaired to other places in Bali. Ongoing construction work as they are expanding the resort was loud and went all day and well into the night. Even had workers stop on the higher platforms and stare into the pool area making it slightly uncomfortable, wouldn’t visit until construction works are over",
                "positive": "Buffet breakfast was yum, aircon was amazingly strong and so good to come back to after a long day out. Many restaurants and markets a short work from property. Would also recommend the restaurants connected to the property and food around the pool"
            },
            {
                "date": "Reviewed: February 9, 2018",
                "name": "Maire Dixon",
                "nationality": "Australia",
                "score": "5.8",
                "header": "Hotel great location staff friendly renovation did not make the stay enjoyable",
                "negative": "the hotel was being renovated and the workmen worked from before 8am and on many night where still working till 9pm the noice made it uncomfortable to sit arond the pool. and you could hear the \"jack-hammer\" and building machinery from our room. We had a a person try to sell us time share in the new Ramayana and when we said we would would get back to him later he become very nasty as he wanted an answer straght away he told us that this is only a 1 of offer.",
                "positive": "The staff where very helpfull & the hotel was in a good location"
            },
            {
                "date": "Reviewed: February 6, 2018",
                "name": "Kylie",
                "nationality": "Australia",
                "score": "9.6",
                "header": "Everything you could want from a hotel and more.",
                "negative": "It was noisy with construction when sitting by the pool because the hotel is undergoing expansion.",
                "positive": "The staff were friendly. The room was excellent. The breakfast was great. The location was superb."
            },
            {
                "date": "Reviewed: December 23, 2017",
                "name": "Yashpal",
                "nationality": "Indonesia",
                "score": "4.6",
                "header": "Location was excellent.",
                "negative": "1. The reservation desk have to more careful while preparing for guest arrival.\r2. I book the hotel for 5 nights and room was provided facing towards under renovating area. \r3. Hotel need to work on breakfast options. Considering the reputation and name, breakfast was not upto mark.\r4. I will strictly recommend not to use the hotel untill renovation is completed.",
                "positive": "Location was excellent."
            },
            {
                "date": "Reviewed: November 29, 2017",
                "name": "Robin",
                "nationality": "Australia",
                "score": "10",
                "header": "Would definitely return",
                "negative": "Nothing",
                "positive": "The location is great right near Kuta Square and the Stadium bar is right underneath.  There are 2 pools both fantastic and you always get a sun lounge.\rBreakfast is great and lots of choices.  Was upgraded to a club room very big was more than happy.  Bed is to die for. Would highly recommend"
            },
            {
                "date": "Reviewed: November 3, 2017",
                "name": "Lauren",
                "nationality": "Australia",
                "score": "10",
                "header": "Love this place, will definitely stay again!",
                "negative": "Got there an hour early (and had mentioned this in my booking) but room not ready, so just had to wait around until exactly 2pm to get to room! Also lots of construction going on as they are renovating, however room very soundproof and did not disturb!",
                "positive": "Love this place! Great location, staff extremely friendly - great room service menu - and awesome value!!"
            },
            {
                "date": "Reviewed: November 1, 2017",
                "name": "Oskar",
                "nationality": "Netherlands",
                "score": "9.2",
                "header": "Amazing place - would definitely come back",
                "negative": "You have an option to get a free bike but they don’t come with a lock and if it gets stolen you have to pay? What’s the point? I saw when we were leaving the locks were bought so that’s good. I guess somebody had to make the point to them. \rSome of the rooms are on a loud side ( they play music outside of the hotel until midnight ) so if you wanna sleep before it’s hard. The staff offered to change the room so they did all the could to fix it.",
                "positive": "Great place! Really friendly stuff and the rooms were huge and clean."
            },
            {
                "date": "Reviewed: October 15, 2017",
                "name": "Ayme",
                "nationality": "Australia",
                "score": "7.1",
                "header": "A great 10 day stay with the family, very reasonable for 2 interconnecting rooms",
                "negative": "Cleanliness and rooms need updating.",
                "positive": "A bit tired and run down and lots of renovations going on. Large rooms. Bathrooms very tired. The staff were friendly and helpful. Nice pool. Very good restaurant and reasonably priced. Handy location but busy."
            },
            {
                "date": "Reviewed: October 13, 2017",
                "name": "Daniela",
                "nationality": "United Kingdom",
                "score": "9.6",
                "header": "Relax time in Bali",
                "negative": "Nothing ",
                "positive": "Very comfortable but the humidity is very high in the rooms you feel it. Staff it was very nice, breakfast very good and the restaurant area very relaxing, i really enjoyed. The pool area and garden there are very nice. "
            },
            {
                "date": "Reviewed: October 9, 2017",
                "name": "Mark",
                "nationality": "United States of America",
                "score": "10",
                "header": "Nice hotel, beautiful grounds, friendly staff, great location.",
                "negative": "There was construction on an adjacent property behind the hotel which was noisy early in the morning and late at night. This was not the fault of the hotel. I have no complaints with the hotel. We enjoyed our stay a lot. I would stay there again.",
                "positive": "Staff were all very friendly. Good breakfast. Great location. Short walk to the beach. Very near restaurants"
            },
            {
                "date": "Reviewed: October 7, 2017",
                "name": "Zerin",
                "nationality": "Australia",
                "score": "10",
                "header": "We had a wonderful stay at Ramayana Hotel.",
                "negative": "Enjoyed it all",
                "positive": "We really enjoyed our time at Ramayana and the staff were accomodating of every need. We even lost a small child's teddy and they tried so hard to help us locate it."
            },
            {
                "date": "Reviewed: October 5, 2017",
                "name": "Helena",
                "nationality": "Australia",
                "score": "9.6",
                "header": "It was value for money",
                "negative": "My first room was facing the street an executive room i changed rooms the next day to a deluxe room it was much better the bed was hard and just took a few days to get used to it...it would have been nice to have music playing near the pool..",
                "positive": "The staff were all lovely made my stay comfortable. Breakfast was ok..location was great i did love eating breakfast with the street view..the food from room service was awesome and satay sticks YUMM"
            },
            {
                "date": "Reviewed: September 26, 2017",
                "name": "Antonia",
                "nationality": "Australia",
                "score": "9.6",
                "header": "Love this place very much and always stay. So conveniuent and fun with lovely service from staff.",
                "negative": "Some of the plumbing needs to be fixed. Breakfast could be hotter.",
                "positive": "The location is key. On the one hand you have the busy streets and shops of Kuta right on your doorstep; you can watch the world go by. On the other hand you have the resort side where you can escape and enjoy the pool and tropical gardens."
            },
            {
                "date": "Reviewed: September 26, 2017",
                "name": "Anonymous",
                "nationality": "Australia",
                "score": "7.9",
                "header": "Staff were wonderful",
                "negative": "Only thing that let the hotel down is the construction happening around the hotel. The noise levels were not good. Would highly recommend to let customers know if construction is happening when booking, This let the hotel down and due to this we will not returning in the near future.",
                "positive": "Staff were wonderful"
            },
            {
                "date": "Reviewed: September 25, 2017",
                "name": "Marilyn",
                "nationality": "Australia",
                "score": "5.4",
                "header": "Pity about loud music spoilt my stay",
                "negative": "The extremely loud music that blasted into my room until the early hours, sleeping was very difficult. If I stayed longer I would ask for a room change or check out.",
                "positive": "Liked the friendly staff and the pool and gardens"
            },
            {
                "date": "Reviewed: September 22, 2017",
                "name": "Always",
                "nationality": "Australia",
                "score": "10",
                "header": "Always consistently good.",
                "negative": "Construction work taking place to expand the hotel",
                "positive": "Always a perfect place to stay in Kuta. Consistently clean & the staff are awesome. Breakfast is delicious. So close to the heart of Kuta shopping."
            },
            {
                "date": "Reviewed: September 20, 2017",
                "name": "Linda",
                "nationality": "Australia",
                "score": "9.6",
                "header": "We enjoyed our time at the Ramyana.",
                "negative": "Rooms are starting to look a little tired. Particularly the Bathroom..",
                "positive": "Helpful friendly staff.Large spacious rooms. .  I would stay again. Have stayed there on 4 previous occasions.Breakfast  was great and variety good. Good menu. Spa services fantastic."
            },
            {
                "date": "Reviewed: September 17, 2017",
                "name": "Anonymous",
                "nationality": "Australia",
                "score": "7.9",
                "header": "Kuta holiday ",
                "negative": "Some building going on so was abit noisy around one of the pools at times. ",
                "positive": "Lovely baliness style hotel. Great food and the spa was fantastic had a couple of massages  and a body scrub with was amazing"
            },
            {
                "date": "Reviewed: September 6, 2017",
                "name": "Mark",
                "nationality": "New Zealand",
                "score": "10",
                "header": "Great Kuta Resort",
                "negative": "The Resort is currently undergoing renovations. The rooms are a bit dated and those on the road side get music noise. Will be a fantastic destination when renovations are completed.",
                "positive": "Staff we lovely. Location was very good as were the resort facilities. Rama Spa...spot on!"
            },
            {
                "date": "Reviewed: September 5, 2017",
                "name": "Anonym",
                "nationality": "Germany",
                "score": "5.8",
                "header": "Close to airport and in the centre of Kuta - but not much more",
                "negative": "Since the hotel is located in the heart of Kuta, the room to the street side is incredibly loud - sleeping without earplugs is impossible\rLittle bugs in the bathroom\rOverall not my best experience on my trip...staying one or two nights when coming from the airport is s good idea, but maybe not more, especially if you don't like the craziness of Kuta",
                "positive": "Some of the staff was really nice and lovely\rPoolbar to get drinks right at the pool is good\rComfy beds\rGood breakfast\rRestaurant was amazing, beautiful place to sit sometimes with live music. Had a very tasty dinner there!"
            },
            {
                "date": "Reviewed: August 26, 2017",
                "name": "Kath",
                "nationality": "Australia",
                "score": "6.7",
                "header": "Good location however noisy",
                "negative": "The hotel was too noisy for me, not a place recommended for a relaxing stay. Much of the noise came from construction of a hotel next door, also noise from other guests in the corridor.",
                "positive": "The location of the hotel is very close to the beach and shopping."
            },
            {
                "date": "Reviewed: August 26, 2017",
                "name": "Daphney",
                "nationality": "Australia",
                "score": "7.1",
                "header": "Huge cockroach, air con shocking",
                "negative": "As above",
                "positive": "The hotel is located in a good spot. The air conditioning was terrible. The room was too hot so I turned the air con to cool, and few hours later the air con takes making a lot of noises. We wake up to find a huge cockroach and the air con leaking water and ice onto our bags. Maintenance come in to fix it and just flick the cockroach away.  Breakfast was very basic. Omelette tasted off. Thank goodness we were only there for 1 night. Staff were good. They didn't apologise or even ask how our stay was, I think that's just their culture."
            },
            {
                "date": "Reviewed: August 25, 2017",
                "name": "Brooke",
                "nationality": "Australia",
                "score": "6.7",
                "header": "Staff nice, basic buffet breakfast room needs freshening up.",
                "negative": "Construction everyday noisy, room wasn't clean found condom packet next to bed and the white towels were grey with holes. Need a renovation on rooms.",
                "positive": "Location"
            },
            {
                "date": "Reviewed: August 23, 2017",
                "name": "Frequent",
                "nationality": "Australia",
                "score": "8.3",
                "header": "Excellent location, good staff, good room, balcony with view...",
                "negative": "Breakfast could have better selection including better fruit. ",
                "positive": "Excellent location, good staff, good room, balcony with view, close to airport, excellent spa and massages, close to shops and markets, mostly clean. "
            },
            {
                "date": "Reviewed: August 22, 2017",
                "name": "Chihoro",
                "nationality": "Australia",
                "score": "7.1",
                "header": "I like the location.",
                "negative": "A view from a balcony of room which I stayed. I was disappointed with the view because there were a lot of buildings under construction and also there was a huge antenna in front of the balcony.",
                "positive": "I like the location. This accommodation is pretty near from Kuta city, so I can go to somewhere in Kuta by walk.\rAlso staff members are always so kind and helped us quickly."
            },
            {
                "date": "Reviewed: August 21, 2017",
                "name": "Imas",
                "nationality": "Netherlands",
                "score": "10",
                "header": "We'll be back again!",
                "negative": "The lights in the room were too dim.",
                "positive": "Such a fine resort!!! It is located in the middle of Kuta Centre but by the time you are in the resorts it felt like you are somewhere faraway from the crowds. Very nice gardens, friendly staff, yummy food in their Indonesian restaurant. I was able to have an early check-in at 9AM. I was here with my two daughters (5 years old and 2 years old), and they had a lot of fun there. It's walking distance to Kuta Beach and all the shops, restaurants, cafes, bars, etc. Very highly recommended!"
            },
            {
                "date": "Reviewed: August 16, 2017",
                "name": "Aasif Lanewala ",
                "nationality": "India",
                "score": "6.3",
                "header": "Excellent Location with one of the best restaurants around.",
                "negative": "Phones were not working during our stay, Our Room AC was leaking.",
                "positive": "Excellent Location with one of the best restaurants around. Best local food we had was in their restaurant."
            },
            {
                "date": "Reviewed: August 16, 2017",
                "name": "Jessica",
                "nationality": "Netherlands",
                "score": "8.3",
                "header": "Very convenient hotel in a great location in the vivid area of kuta",
                "negative": "Ramayana is now under construction (July August 2017) and it's a huge construction site which for defenite will take at least another year.",
                "positive": "Stayed several times at Ramayana due to its perfect location and nice hotel facilities. It's a vivid and coZy hotel with very friendly staff. They offered us the brand newly done family room. Great family room. Breakfast buffet is simple but good. The diner menu/ dishes are great and of good quality. They have two basic pools."
            },
            {
                "date": "Reviewed: August 16, 2017",
                "name": "Michael",
                "nationality": "Australia",
                "score": "5.8",
                "header": "Not very happy with booking .com after",
                "negative": "Booking.com did not tell us that the hotel was under major revisions the noise was terrible manager was kind enough to move us",
                "positive": "The manager was very helpful when we had a complaint about the building work that was going on at the hotel"
            },
            {
                "date": "Reviewed: August 13, 2017",
                "name": "SweetieScarlet",
                "nationality": "Thailand",
                "score": "8.8",
                "header": "Location Location Location!",
                "negative": "Club Resort Room is quite dark. Should have more Down lights. Should provide slippery mat in shower room. Wash basin has good design but it's hard for usage. Should avoid having Indian guests. (They used hands at Salad Bar!)",
                "positive": "As the hotel is now renovated and has limited rooms. We were upgraded from an Executive Room to Club Resort Room which we were surprised. The staffs are friendly and provided good service. Garah Restaurant is famous as always - everybody wanted to dine here. We were so happy having dinner there. Overall, we had a pleasant stay."
            },
            {
                "date": "Reviewed: August 8, 2017",
                "name": "Anonymous",
                "nationality": "Australia",
                "score": "7.1",
                "header": "Quite and good location",
                "negative": "We wanted a double room but got a twin, breakfast was OK but the food was only warm but you could get eggs cooked fresh. ",
                "positive": "the rooms were quiete and had a balcony"
            },
            {
                "date": "Reviewed: August 7, 2017",
                "name": "Steve",
                "nationality": "United Kingdom",
                "score": "8.8",
                "header": "A great location, right in the center near Kuta square.",
                "negative": "There were building works being carried out at the hotel where they are extending it.  Didn't really cause us a problem as we went to the beach every day but if you want to sit around a pool all day long you could get fed up with the noise.",
                "positive": "A great location, right in the center near Kuta square.  All members of staff were exceptional and extremely friendly.  The family room we had was extremely spacious"
            },
            {
                "date": "Reviewed: August 2, 2017",
                "name": "Isnaniyah",
                "nationality": "Sweden",
                "score": "4.2",
                "header": "This hotel is worthless👎👎",
                "negative": "The reception are not friendly. First night my room was flooded with water and air conditioner was not cold. It was very difficult to inform them because the room phone didn't work. I contacted them via mobile and they answered after more than 10 times tried because it was in the middle of the night. At the end they put many towels on the floor. In the morning when I complained seemed night staff didn't inform to the day staff. At the end they gave me a new room (without saying any apologies after I suffered one night couldn't sleep and without gave me any compensation). My new room was not perfect. The bathtub didn't work properly and the pillows covers was very old, broken in every where 😣\rOh my.. I gave up ☹️",
                "positive": "Location"
            },
            {
                "date": "Reviewed: July 27, 2017",
                "name": "Josef",
                "nationality": "South Africa",
                "score": "3.8",
                "header": "Terrible",
                "negative": "Old hotel run done with various problems like no hot water, problems with flushing old toilets, air conditioning , wifi, telephone system of for more than a week.",
                "positive": "Location"
            },
            {
                "date": "Reviewed: July 25, 2017",
                "name": "Ravi",
                "nationality": "Singapore",
                "score": "5.0",
                "header": "Many things need to improved upon",
                "negative": "After checked-in(~1:15 Am) wifi was not getting connected, I had do reply some important official mails, I rushed to the Telephone to check with reception, but Telephone in the room was not working. I came down to reception and informed receptionist.  Technician arranged to check WIFI immediately but you can imaging at 2 am someone is working in your room for 30 mins. Ultimately wifi issue resolved but then no face-towel (only Bath Towel) in Toilet. I was not in a position to go down again.\rAs it was already very late we had coffee in Night then after getting up in early morning realized that there was no more sugar. While leaving for sight seeing I requested at reception to keep some Extra sugar and cream sachet but answer was \"only 1 per day\", I was shocked and then decide to not ask for anything...\rSecond day onward TV was not at all working, wifi was having very poor connectivity and frequent disconnection.\r  \rRoom provided was on 8th floor and extremely noisy (till 1 am very loud music), As my baby was not getting sleep in noisy room.\r As a guest from other countries come to Bali, to enjoy our time not to get inconvenienced for petty things. It is good if all information provided before hand so guests will be mentally ready.\rI hope that management take feedback positively and improve on services.",
                "positive": "Location"
            },
            {
                "date": "Reviewed: July 22, 2017",
                "name": "Roxene",
                "nationality": "Australia",
                "score": "9.2",
                "header": "Lovely Hotel with perfect location.",
                "negative": "Booked a double bed but were given 2 single beds. Noisy during the day around the pool due to construction going on next door, but you put up with it.",
                "positive": "Location was perfect and the staff were excellent."
            },
            {
                "date": "Reviewed: July 21, 2017",
                "name": "Haley",
                "nationality": "Australia",
                "score": "10",
                "header": "Ramayana-Great stay in heart of Kuta",
                "negative": "We couldn't find a kettle in the room but they did have a coffee machine down in the restaurant so no big deal. We would have loved an open balcony as the one we had was an enclosed room with windows and got a little warm. I was sure it had balcony stated and pictured when I booked through booking.com. All in all it was a great stay though and would highly recommend it here. They are currently going through some extensions so a little building noise around pool area. The hotel extensions will be finished next August and it looks like it's going to be bigger and better than ever!",
                "positive": "We really enjoyed our stay; friendly staff, great food in the many adjoining restaurants, lovely and helpful people. Very clean and very well taken care of. The grounds were beautiful and constantly maintained. Relaxing pool area, showers, very clean, towel hire, drink service. Best central Kuta location for access to markets, restaurants, everything."
            },
            {
                "date": "Reviewed: July 13, 2017",
                "name": "Karen",
                "nationality": "Australia",
                "score": "6.3",
                "header": "I wont return",
                "negative": "The room could have been a lot cleaner,,, the wardrobe smelt of urine,, I could not hang my clothes in there.\rAlso, the breakfast was cold every morning, except for the eggs,,,,, everything else that should have been hot was cold.",
                "positive": "The bed was very comfortable."
            },
            {
                "date": "Reviewed: July 6, 2017",
                "name": "Siobhan",
                "nationality": "Australia",
                "score": "9.2",
                "header": "Smiles all round.",
                "negative": "Nothing!",
                "positive": "Wonderful atmosphere! The staff are very helpful and welcoming. \rWe will stay again next time. Food at breakfast was fresh, varied and abundant. \rWe had a wonderful holiday."
            },
            {
                "date": "Reviewed: July 3, 2017",
                "name": "Jackie",
                "nationality": "Australia",
                "score": "9.6",
                "header": "Great for people or groups with no kids",
                "negative": "Nothing could of been more perfect. However I would not stay with kids - no kid pool or services .",
                "positive": "Loved the service , good range with breakfast and great prices for menu with dinner and lunch"
            },
            {
                "date": "Reviewed: June 26, 2017",
                "name": "Prasoon Jha",
                "nationality": "India",
                "score": "9.2",
                "header": "Awesome stay at Ramayana - splendid hospitality, location",
                "negative": "Nothing really!",
                "positive": "Service: Top class - the staff made us feel absolutely welcome. They helped us out with all our requests, big or small. \rAmbience: Loved the greenery, pools and the general of decor of Ramayana\rBreakfast buffet - splendid, sumptuous and caters to all taste buds!\rRoom service - needless to stay, very good\rLocation - close to the airport and in the heart of Kuta"
            }
        ]
    }
}